In [4]:
from sqlalchemy.engine import create_engine
import pandas as pd

In [2]:
host='172.24.40.247'
user = 'hv'
password = '123456'
database = 'salesdb'
port = '3306'
# chuoi ket noi
connection_string = "mysql+pymysql://{user}:{password}@{host}:{port}/{database}?charset=UTF8".format(user=user, password=password, host=host, port=port, database=database)

In [3]:
conn = create_engine(connection_string)

In [5]:
df = pd.read_sql('select * from customers', conn)

In [6]:
df.shape

(91, 6)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 91 entries, 0 to 90
Data columns (total 6 columns):
Id           91 non-null int64
FirstName    91 non-null object
LastName     91 non-null object
City         91 non-null object
Country      91 non-null object
Phone        91 non-null object
dtypes: int64(1), object(5)
memory usage: 4.3+ KB

In [8]:
df.head()

   Id  FirstName  LastName         City  Country           Phone
0   1      Maria    Anders       Berlin  Germany     030-0074321
1   2        Ana  Trujillo  México D.F.   Mexico    (5) 555-4729
2   3    Antonio    Moreno  México D.F.   Mexico    (5) 555-3932
3   4     Thomas     Hardy       London       UK  (171) 555-7788
4   5  Christina  Berglund        Luleå   Sweden   0921-12 34 65